<?php

return [
    'hello' => "Прежде всего мне нужно знать, на каком языке вы говорите? Это повлияет только на язык меню!\n\nFirst of all I need to know which language do you speak? It’s will affect only on the menu language!",
    'about_me' => 'Как мы уже говорили, данный бот создан энтузиастами, у нас нету многолетнего опыта в программирование и создание ботов - мы просто любим игры и хотели бы найти кого-то из наших городов. В боте никогда не придется платить, что бы увидеть кто вам поставил лайк и найти взаимную симпатию, все будет абсолютно бесплатно и ограничиваться только железом что бы не было спамеров, но за это будем у вас просить поддержать наши “возможных” будущих спонсоров и возможно будем держаться на донатах! На данный момент лучшей поддержкой для нас будет заказать буст у @boost_ace',

    'your_name' => 'Отлично, как тебя зовут?',
    'your_age' => 'Очень приятно, :name! Сколько тебе лет?',
    'your_game_playing' => 'Выберите игру (игры) в которые ты играешь!',

    'your_countries' => 'Напиши страну, как можно точнее!',
    'your_countries_select' => 'Выберете подходящую страну:',

    'your_cities' => 'Напиши из какого ты города, как можно точнее!',
    'your_cities_select' => 'Выберете подходящий город:',

    'about_you' => 'Теперь расскажи о себе. Можешь рассказывать все что угодно: увлечения, во что еще играешь и т.д.',
    'sex' => 'Отлично, теперь выбери свой пол?',
    'sex_partner' => 'Теперь выбери пол партнера?',
    'give_photo' => 'Пришли свою фотографию',

    'whom_find' => [
        'title' => 'И напоследок, кого ты хочешь найти?',
        'people_real_life' => '👩‍❤️‍👨 Человека в реальной жизни',
        'people_team' => '👥 Команда для парков',
        'simple_play' => '👾 Просто поиграть ',
        'i_find' => 'Я ищу: ',
    ],

    'finished' => "🏆 Теперь проверь свою анкету! Все ли верно заполнено!?\n\n",
    'main' => "Анкета:\n\n",

    'years_decl_num' => [
      '1' => ' год',
      '3' => ' года',
      '5' => ' лет',
    ],

    'edit_profile' => "Здесь ты можете редактировать свой профиль! Для этого просто нажми на пункт того, что ты хочешь изменить!\n\n",

    'profile' => [
      'name' => 'Тебя сейчас зовут :name! Но, если это не так, напиши ниже имя:',
      'age' => 'Тебе разве не :age? Если да, то напиши нижи свой возраст. Только честно 🙃'
    ],

    'loading' => [
        'text_1' => 'Мы ищем подходящую пару...',
        'text_2' => 'Еще немного, мы найдем идеальную пару!',
        'text_3' => 'Система ищет кандидата..',
        'text_4' => 'Анализируем пары для вас...',
        'text_5' => 'Еще пару секунд и мы найдем пару!'
    ],

    'partner_not_found' => 'Сейчас нет подходящих пар для вас. Приходите позже!',
    'like_next_text' => 'Но на этом не все! Вы можете продолжить искать пару дальше!',
    'text_send_message' => 'А теперь напишите сообщение, которое хотите отправить.',
    'have_like' => 'Ты понравился :count, показать их?',

    'buttons' => [
        'skip' => '🙀 Пропустить',
        'show_like' => 'Показать',
        'like' => 'Искать дальше',
        'cancel' => 'Отменить',
        'save' => 'Сохранить',
        'good' => '👍 Хорошо',
        'continue' => '🤟 Продолжить',
        'not_exist_country' => '😔 Тут нет моей страны',
        'not_exist_city' => '😔 Тут нет моего города',
        'all_right' => '👍 Все верно!',
        'show_questionnaires' => 'Смотреть анкеты',
        'not_looking' => 'Я больше никого не ищу',
        'edit_profile' => '⚙️ Изменить анкету',
        'main' => 'Моя анкета',

        'sex' => [
            'female' => '🙍‍♀️ Женский',
            'female_r' => 'женского пола',
            'male' => '🙎‍♂️ Мужской',
            'male_r' => 'мужского пола',
            'decided' => '👕👚 Не определился(ась)',
            'no_matter' => '👫 Не важно'
        ],

        'edit' => [
            'name' => '💛 Имя',
            'age' => '👀 Возраст',
            'games' => '👾 Игры',
            'country' => '🇷🇺 Страна',
            'city' => '🏛 Город',
            'about_me' => '🐹 О себе',
            'sex' => '🕺 Свой пол',
            'sex_partner' => '👫 Пол партнера',
            'photo' => '🏞 Фотографию',
            'find_whom' => '👩‍❤️‍👨 Кого ищу',
            'back' => '⬅️ Вернуться назад'
        ]
    ],

    'errors' => [
        'wrong_age' => 'Упс, ошибочка вышла, возраст должен быть числом от 14 до 99. Попробуй еще раз!',
        'countries_not_found' => 'Мы не смогли найти такую страну, попробуйте написать еще раз:',
        'cities_not_found' => 'Мы не смогли найти такой город, попробуйте написать еще раз:',
        'wrong_photo' => 'Ой, нужно же загрузить фотографию...',
    ],
];